{
  "Desenvoldedor Front-end": "Front-end developer",
  "Formações": "Formations",
  "Sobre mim": "About me",
  "Projetos": "Projects",
  "Habilidades": "Skills",
  "Em breve": "Coming soon",
  "Fechar": "Close",
  "Visitar página": "Visit page",
  "HTML (Linguagem de Marcação de HiperTexto) é o bloco de construção mais básico da web. Define o significado e a estrutura do conteúdo da web. Outras tecnologias além do HTML geralmente são usadas para descrever a aparência/apresentação (CSS) ou a funcionalidade/comportamento (JavaScript) de uma página da web.": "HTML (HyperText Markup Language) is the most basic building block of the web. Defines the meaning and structure of web content. Technologies other than HTML are often used to describe the look/presentation (CSS) or functionality/behavior (JavaScript) of a web page.",
  "CSS (Cascading Style Sheets ou Folhas de Estilo em Cascata) é uma linguagem de estilo (en-US) usada para descrever a apresentação de um documento escrito em HTML ou em XML (incluindo várias linguagens em XML como SVG, MathML ou XHTML). O CSS descreve como elementos são mostrados na tela, no papel, na fala ou em outras mídias.": "CSS (Cascading Style Sheets) is a style language (en-US) used to describe the presentation of a document written in HTML or XML (including various XML languages ​​such as SVG, MathML or XHTML). CSS describes how elements are displayed on screen, on paper, in speech, or in other media.",
  "JavaScript® (às vezes abreviado para JS) é uma linguagem leve, interpretada e baseada em objetos com funções de primeira classe, mais conhecida como a linguagem de script para páginas Web, mas usada também em vários outros ambientes sem browser, tais como node.js, Apache CouchDB e Adobe Acrobat. O JavaScript é uma linguagem baseada em protótipos, multi-paradigma e dinâmica, suportando estilos de orientação a objetos, imperativos e declarativos (como por exemplo a programação funcional).": "JavaScript® (sometimes shortened to JS) is a lightweight, interpreted, object-based language with first-class functions, better known as the scripting language for web pages, but also used in many other non-browser environments such as node. js, Apache CouchDB and Adobe Acrobat. JavaScript is a prototype-based, multi-paradigm and dynamic language, supporting object-oriented, imperative and declarative styles (such as functional programming).",
  "Git é um sistema de controle de versão distribuído gratuito e de código aberto projetado para lidar com tudo, desde projetos pequenos a muito grandes com velocidade e eficiência.": "Git is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency.",
  "O React é uma biblioteca front-end JavaScript de código aberto com foco em criar interfaces de usuário em páginas web.": "React is an open source JavaScript front-end library focused on creating user interfaces on web pages.",
  "O MUI oferece um conjunto abrangente de ferramentas de interface do usuário para ajudá-lo a enviar novos recursos mais rapidamente.": "MUI offers a comprehensive suite of UI tools to help you ship new features faster.",
  "TanStack Query oferece consultas e mutações declarativas e autogerenciadas sempre atualizadas que melhoram diretamente as experiências do desenvolvedor e do usuário.": "TanStack Query offers always up-to-date declarative and self-managed queries and mutations that directly improve developer and user experiences.",
  "Redux é uma biblioteca JavaScript de código aberto para gerenciar o estado do aplicativo. É mais comumente usado com bibliotecas como React ou Angular para criar interfaces de usuário.": "Redux is an open source JavaScript library for managing application state. It is most commonly used with libraries like React or Angular to create user interfaces.",
  "Styled components é uma biblioteca que possibilita escrever códigos CSS dentro do JavaScript. Com ele, você pode criar websites bonitos e funcionais. Além disso, ganhar mais agilidade e precisão no desenvolvimento web.": "Styled components is a library that makes it possible to write CSS code inside JavaScript. With it, you can create beautiful and functional websites. In addition, gain more agility and precision in web development.",
  "Sass é uma linguagem de folhas de estilo concebida inicialmente por Hampton Catlin e desenvolvida por Natalie Weizenbaum. Depois de suas versões iniciais, Weizenbaum e Chris Eppstein continuaram a estender Sass com SassScript, uma simples linguagem de script usada em arquivos Sass.": "Sass is a stylesheet language initially conceived by Hampton Catlin and developed by Natalie Weizenbaum. After their initial releases, Weizenbaum and Chris Eppstein continued to extend Sass with SassScript, a simple scripting language used in Sass files."
}
