[
  {
    "type": "HTML",
    "pageUrl": "https://developer.mozilla.org/pt-BR/docs/Web/HTML",
    "description": "HTML (Linguagem de Marcação de HiperTexto) é o bloco de construção mais básico da web. Define o significado e a estrutura do conteúdo da web. Outras tecnologias além do HTML geralmente são usadas para descrever a aparência/apresentação (CSS) ou a funcionalidade/comportamento (JavaScript) de uma página da web."
  },
  {
    "type": "CSS",
    "pageUrl": "https://developer.mozilla.org/pt-BR/docs/Web/CSS",
    "description": "CSS (Cascading Style Sheets ou Folhas de Estilo em Cascata) é uma linguagem de estilo (en-US) usada para descrever a apresentação de um documento escrito em HTML ou em XML (incluindo várias linguagens em XML como SVG, MathML ou XHTML). O CSS descreve como elementos são mostrados na tela, no papel, na fala ou em outras mídias."
  },
  {
    "type": "JAVASCRIPT",
    "pageUrl": "https://developer.mozilla.org/pt-BR/docs/Web/JavaScript",
    "description": "JavaScript® (às vezes abreviado para JS) é uma linguagem leve, interpretada e baseada em objetos com funções de primeira classe, mais conhecida como a linguagem de script para páginas Web, mas usada também em vários outros ambientes sem browser, tais como node.js, Apache CouchDB e Adobe Acrobat. O JavaScript é uma linguagem baseada em protótipos, multi-paradigma e dinâmica, suportando estilos de orientação a objetos, imperativos e declarativos (como por exemplo a programação funcional)."
  },
  {
    "type": "GIT",
    "pageUrl": "https://git-scm.com/",
    "description": "Git é um sistema de controle de versão distribuído gratuito e de código aberto projetado para lidar com tudo, desde projetos pequenos a muito grandes com velocidade e eficiência."
  },
  {
    "type": "REACT",
    "pageUrl": "https://pt-br.reactjs.org/",
    "description": "O React é uma biblioteca front-end JavaScript de código aberto com foco em criar interfaces de usuário em páginas web."
  },
  {
    "type": "MATERIAL_UI",
    "pageUrl": "https://mui.com/pt/",
    "description": "O MUI oferece um conjunto abrangente de ferramentas de interface do usuário para ajudá-lo a enviar novos recursos mais rapidamente. "
  },
  {
    "type": "REACT_QUERY",
    "pageUrl": "https://www.npmjs.com/package/react-query",
    "description": "TanStack Query oferece consultas e mutações declarativas e autogerenciadas sempre atualizadas que melhoram diretamente as experiências do desenvolvedor e do usuário."
  },
  {
    "type": "REDUX",
    "pageUrl": "https://redux.js.org/",
    "description": "Redux é uma biblioteca JavaScript de código aberto para gerenciar o estado do aplicativo. É mais comumente usado com bibliotecas como React ou Angular para criar interfaces de usuário. "
  },
  {
    "type": "STYLED_COMPONENTS",
    "pageUrl": "https://styled-components.com/",
    "description": "Styled components é uma biblioteca que possibilita escrever códigos CSS dentro do JavaScript. Com ele, você pode criar websites bonitos e funcionais. Além disso, ganhar mais agilidade e precisão no desenvolvimento web."
  },
  {
    "type": "SASS",
    "pageUrl": "https://sass-lang.com/",
    "description": "Sass é a linguagem de extensão CSS de nível profissional mais madura, estável e poderosa do mundo."
  }
]
